{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "- https://www.lyonwj.com/2015/06/16/nlp-with-neo4j/\n",
    "- 他の内容は以下にある\n",
    "  \n",
    "  1.https://github.com/johnymontana/nlp-graph-notebooks"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 文章の中で、2つの単語がどれくらい似ているかを単語を直接入力することで比較する"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 207,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "import re, string\n",
    "from neo4j.v1 import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 208,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver('bolt://127.0.0.1:7687', auth=('neo4j', 'Mizuchan123'))\n",
    "#graphdb = Graph('http://neo4j:neo4j@localhost:7474/db/data')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 209,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "INSERT_QUERY = '''\n",
    "FOREACH (t IN $wordPairs |\n",
    "    MERGE (w0:Word {word: t[0]})\n",
    "    MERGE (w1:Word {word: t[1]})\n",
    "    CREATE (w0)-[:NEXT_WORD]->(w1)\n",
    "    )\n",
    "\n",
    "'''\n",
    "\n",
    "LEFT1_QUERY = '''\n",
    "MATCH (s:Word {word: {word}})\n",
    "MATCH (w:Word)-[:NEXT_WORD]->(s)\n",
    "RETURN w.word as word\n",
    "\n",
    "'''\n",
    "\n",
    "RIGHT1_QUERY = '''\n",
    "MATCH (s:Word {word: {word}})\n",
    "MATCH (w:Word)<-[:NEXT_WORS]-(s)\n",
    "RETURN w.word as word\n",
    "\n",
    "'''"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 254,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def insert_query(tx, wordPairs):\n",
    "    tx.run('FOREACH (t IN $wordPairs | MERGE (w0:Word {word: t[0]}) MERGE (w1:Word {word: t[1]}) CREATE (w0)-[:NEXT_WORD]->(w1))',\n",
    "           wordPairs=wordPairs)\n",
    "    \n",
    "def left1_query(tx, word):\n",
    "    words = []\n",
    "    for result in tx.run('MATCH (s:Word {word: $word})'\n",
    "                       'MATCH (w:Word)-[:NEXT_WORD]->(s)'\n",
    "                       'RETURN w.word as word', word=word):\n",
    "        for line in result:\n",
    "            #print(line)\n",
    "            words.append(line)\n",
    "    words = set(words)\n",
    "    return words"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 211,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def arrifySentence(sentence):\n",
    "    sentence = sentence.lower()\n",
    "    sentence = sentence.strip()\n",
    "    exclude = set(string.punctuation)\n",
    "    regex = re.compile('[%s]' % re.escape(string.punctuation))\n",
    "    sentence = regex.sub('', sentence)\n",
    "    wordArray = sentence.split()\n",
    "    tupleList = []\n",
    "    for i, word in enumerate(wordArray):\n",
    "        if i+1 == len(wordArray):\n",
    "            break\n",
    "        tupleList.append([word, wordArray[i+1]])\n",
    "    return tupleList"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 212,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[['this', 'is'], ['is', 'a'], ['a', 'pen']]\n"
     ]
    }
   ],
   "source": [
    "print(arrifySentence(\"This is a pen\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 213,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def loadFile():\n",
    "    with driver.session() as session:\n",
    "        with open(\"ceeaus.dat\", encoding='ISO-8859-1') as f:\n",
    "            count = 0\n",
    "            for l in f:\n",
    "\n",
    "                params = {\"wordPairs\": arrifySentence(l)}\n",
    "                session.write_transaction(insert_query, params[\"wordPairs\"])\n",
    "                #print(params)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 214,
   "metadata": {
    "scrolled": false
   },
   "outputs": [],
   "source": [
    "loadFile()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 279,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def left1(word):\n",
    "    with driver.session() as session:\n",
    "        params = {\n",
    "            'word': word.lower()\n",
    "        }\n",
    "        result = session.read_transaction(left1_query, params[\"word\"])\n",
    "        #関数で呼び出すと、set（集合）ではなくなるため、再度実施する。\n",
    "        result = set(result)\n",
    "        return result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 258,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def right1_query(tx, word):\n",
    "    words = []\n",
    "    for result in tx.run('MATCH (s:Word {word: $word})'\n",
    "                       'MATCH (w:Word)<-[:NEXT_WORD]-(s)'\n",
    "                       'RETURN w.word as word', word=word):\n",
    "        for line in result:\n",
    "            #print(line)\n",
    "            words.append(line)\n",
    "    words = set(words)\n",
    "    return words"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 266,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def right1(word):\n",
    "    with driver.session() as session:\n",
    "        params = {\n",
    "            'word': word.lower()\n",
    "        }\n",
    "        \n",
    "        result = session.read_transaction(right1_query, params[\"word\"])\n",
    "        result = set(result)\n",
    "        return result"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "https://mieruca-ai.com/ai/jaccard_dice_simpson/"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 260,
   "metadata": {},
   "outputs": [],
   "source": [
    "def jaccard(a,b):\n",
    "    intSize = len(a.intersection(b))\n",
    "    unionSize = len(a.union(b))\n",
    "    return intSize/unionSize"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 221,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.3333333333333333"
      ]
     },
     "execution_count": 221,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "jaccard({'This', 'is'}, {'That', 'is'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 238,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "set"
      ]
     },
     "execution_count": 238,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "type({'This', 'is'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 223,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 223,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len({'This', 'is'}.intersection({'That', 'is'}))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 224,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "3"
      ]
     },
     "execution_count": 224,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len({'This', 'is'}.union({'That', 'is'}))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 277,
   "metadata": {},
   "outputs": [],
   "source": [
    "def paradigSimilarity(w1, w2):\n",
    "    return (jaccard(left1(w1), left1(w2)) + jaccard(right1(w1),right1(w2)))/2.0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 278,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.20997973657548125"
      ]
     },
     "execution_count": 278,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "paradigSimilarity(\"school\", \"university\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 以下は、Neo4jを簡易的に試行するためのもの"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from neo4j.v1 import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver('bolt://127.0.0.1:7687', auth=('neo4j', 'Mizuchan123'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def clear_db(tx):\n",
    "    tx.run(\"MATCH (n) DETACH DELETE n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def add_friend(tx, name, friend_name=None):\n",
    "    if not friend_name:\n",
    "        return tx.run(\"CREATE (p:Person {name: $name}) RETURN p\", name=name)\n",
    "    return tx.run('MATCH (p:Person {name: $name})'\n",
    "                 'CREATE (p)-[:FRIEND]->(:Person {name: $friend_name})', name=name, friend_name=friend_name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def print_friend(tx, name):\n",
    "    for record in tx.run('MATCH (p {name: $name})-[:FRIEND]-(yourFriends)'\n",
    "                        'RETURN p, yourFriends', name=name):\n",
    "        print(record)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record p=<Node id=6 labels={'Person'} properties={'name': 'Jun'}> yourFriends=<Node id=47 labels={'Person'} properties={'name': 'Nancy'}>>\n",
      "<Record p=<Node id=6 labels={'Person'} properties={'name': 'Jun'}> yourFriends=<Node id=7 labels={'Person'} properties={'name': 'Mike'}>>\n",
      "<Record p=<Node id=9 labels={'Person'} properties={'name': 'Jun'}> yourFriends=<Node id=48 labels={'Person'} properties={'name': 'Nancy'}>>\n",
      "<Record p=<Node id=9 labels={'Person'} properties={'name': 'Jun'}> yourFriends=<Node id=46 labels={'Person'} properties={'name': 'Mike'}>>\n",
      "<Record p=<Node id=9 labels={'Person'} properties={'name': 'Jun'}> yourFriends=<Node id=12 labels={'Person'} properties={'name': 'Nancy'}>>\n",
      "<Record p=<Node id=9 labels={'Person'} properties={'name': 'Jun'}> yourFriends=<Node id=10 labels={'Person'} properties={'name': 'Mike'}>>\n"
     ]
    }
   ],
   "source": [
    "with driver.session() as session:\n",
    "    #session.write_transaction(clear_db)\n",
    "    session.write_transaction(add_friend, 'Jun')\n",
    "    for f in [\"Mike\", \"Nancy\"]:\n",
    "        session.write_transaction(add_friend, 'Jun', f)\n",
    "    session.read_transaction(print_friend, \"Jun\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def add_friend(tx, name, yourFriend):\n",
    "    tx.run(\"MATCH (p: Person {name: $name})\"\n",
    "          \"CREATE (p)-[:FRIEND]-(:Person {name: $yourFriend})\", name=name, yourFriend=yourFriend)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
